export const navList = [
    {
        label: '',
        bg: require('./img/tab/navigation01_nor.png'),
        activeBg: require('./img/tab/navigation01_sel.png'),
    },
    {
        label: '',
        bg: require('./img/tab/navigation02_nor.png'),
        activeBg: require('./img/tab/navigation02_sel.png'),
    },
    {
        label: '',
        bg: require('./img/tab/navigation03_nor.png'),
        activeBg: require('./img/tab/navigation03_sel.png'),
    },
    {
        label: '',
        bg: require('./img/tab/navigation04_nor.png'),
        activeBg: require('./img/tab/navigation04_sel.png'),
    },
];

export const formatCon = [
    '<p>665</p>',
    '<p>活动自然月中，请及时使用已获得的元宝；可兑换元宝数量为元宝活动中已获得元宝数量总和，可兑换的奖励不可高于本月剩余可用元宝数量；所有奖励均以彩金形式派发，且兑换完成后将会减少相应已兑换的元宝数量！</p>',
    '<ol><li>元宝活动中可领取元宝的会员请于当日点击领取元宝，当日未领取的元宝次日00:00重置；已领取的元宝请于当月完成兑换，次月1日00:00重置所有元宝；已兑换的奖励将在十分钟内派发至中心钱包，仅需1倍有效流水即可出款；</li><li>本月剩余可用元宝为元宝活动中累计获得的可兑换元宝总和，兑换后减少已使用的元宝数量；兑换后可继续累积获得元宝，且当月可多次兑换；所有奖励均以彩金形式派发；</li><li>重置元宝按自然月计算（比如：9月1日-9月30日为一个自然月）；</li><li>本活动与其他活动共享（注：若其他优惠明确标注不与本活动共享，将按照其他活动规则要求计算）；</li><li>每位真实有效玩家/每一手机号码/电子邮箱/户籍地址/现居地址/同一银行卡/每一IP地址/每一台电脑或上网设备，仅能享受每种活动方案的一次优惠，若有违规者，将不享受此红利；</li><li>若发现有套利客户，对赌或不诚实获取盈利之行为，将取消其优惠资格；</li><li>为避免文字理解差异，OD体育保留本活动最终解释权。</li></ol>',
    '<h2>签到领元宝：</h2><p>每日登录的会员在此页面点击领取签到元宝（或于弹出页面领取），连续完成签到还可额外获得元宝加赠，签到中断时重新开始计算签到天数，连续签到每个周期为7天直至当月结束，次月将重置已领到的元宝，请及时兑换！</p>',
    '<h2>时间间隔领元宝：</h2><p>点击签到后，根据在线时长间隔点击领取对应元宝，当日未领取的元宝将于次日00:00重置。</p>',
    '<ol><li>OD全体会员，每日登录即可点击签到领取签到元宝，连续完成签到将有额外元宝赠送，签到中断时重新开始计算签到天数，连续签到每个周期为7天直至当月结束，次月1日00:00将重置已领到的元宝，请及时兑换！</li><li>签到元宝可在弹出页面领取，也可至活动页面点击领取，领取到的元宝将累计计算到本月剩余可用元宝中，领取记录可在元宝活动的相关页面中查看；</li><li>重置元宝按自然月计算（比如：9月1日-9月30日为一个自然月）；</li><li>活动有效在线天数为连续在线，中断签到无法补签；</li><li>此活动与其他元宝任务共享（注：若其他优惠明确标注不与本活动共享，将按照其他活动规则要求计算）；</li><li>每位真实有效玩家/每一手机号码/电子邮箱/户籍地址/现居地址/同一银行卡/每一IP地址/每一台电脑或上网设备，仅能享受每种活动方案的一次优惠，若有违规者，将不享受此红利；</li><li>若发现有套利客户，对赌或不诚实获取盈利之行为，将取消其优惠资格；</li><li>为避免文字理解差异，OD体育保留本活动最终解释权。</li></ol>',
    '<p>每日累计存款到达指定档位，即可领取对应档位元宝，每日仅可领取一次，请及时领取，次日00:00将自动重置！</p>',
    '<ol><li>每日累计完成相应的存款≥100元，即可点击领取元宝；请充值并成功到账后点击立即领取，以领取前符合的最高充值档位派发元宝，每日仅限一次请及时点击领取，次日00:00将自动重置！</li><li>重置元宝按自然月计算（比如：9月1日-9月30日为一个自然月）；</li><li>虚拟币或其他方式存款按照实际到账金额和实际到账时间计算；</li><li>此活动与其他元宝任务共享（注：若其他优惠明确标注不与本活动共享，将按照其他活动规则要求计算）；</li><li>每位真实有效玩家/每一手机号码/电子邮箱/户籍地址/现居地址/同一银行卡/每一IP地址/每一台电脑或上网设备，仅能享受每种活动方案的一次优惠，若有违规者，将不享受此红利；</li><li>若发现有套利客户，对赌或不诚实获取盈利之行为，将取消其优惠资格；</li><li>为避免文字理解差异，OD体育保留本活动最终解释权。</li></ol>',
    '<p>对操作结果的轻量级反馈，无需用户操作即可自行消失。</p>',
    '<table><tbody><tr><td colspan="1" rowspan="1">场馆累计<br />有效投注额</td><td colspan="1" rowspan="1">体育<br />场馆</td><td colspan="1" rowspan="1">电竞<br />场馆</td><td colspan="1" rowspan="1">真人<br />场馆</td><td colspan="1" rowspan="1">棋牌<br />场馆</td><td colspan="1" rowspan="1">彩票<br />场馆</td><td colspan="1" rowspan="1">电子<br />场馆</td></tr><tr><td colspan="1" rowspan="1">≥1000元</td><td colspan="1" rowspan="1">400</td><td colspan="1" rowspan="1">300</td><td colspan="1" rowspan="1">200</td><td colspan="1" rowspan="1">200</td><td colspan="1" rowspan="1">200</td><td colspan="1" rowspan="1">200</td></tr><tr><td colspan="1" rowspan="1">≥5000元</td><td colspan="1" rowspan="1">1800</td><td colspan="1" rowspan="1">1600</td><td colspan="1" rowspan="1">1000</td><td colspan="1" rowspan="1">1000</td><td colspan="1" rowspan="1">1000</td><td colspan="1" rowspan="1">1200</td></tr><tr><td colspan="1" rowspan="1">≥10000元</td><td colspan="1" rowspan="1">3800</td><td colspan="1" rowspan="1">3600</td><td colspan="1" rowspan="1">1600</td><td colspan="1" rowspan="1">1600</td><td colspan="1" rowspan="1">1600</td><td colspan="1" rowspan="1">1800</td></tr><tr><td colspan="1" rowspan="1">≥50000元</td><td colspan="1" rowspan="1">18800</td><td colspan="1" rowspan="1">13800</td><td colspan="1" rowspan="1">6600</td><td colspan="1" rowspan="1">6600</td><td colspan="1" rowspan="1">6600</td><td colspan="1" rowspan="1">8800</td></tr><tr><td colspan="1" rowspan="1">≥100000元</td><td colspan="1" rowspan="1">38800</td><td colspan="1" rowspan="1">36600</td><td colspan="1" rowspan="1">13800</td><td colspan="1" rowspan="1">13800</td><td colspan="1" rowspan="1">13800</td><td colspan="1" rowspan="1">18800</td></tr><tr><td colspan="1" rowspan="1">≥500000元</td><td colspan="1" rowspan="1">168800</td><td colspan="1" rowspan="1">136600</td><td colspan="1" rowspan="1">68800</td><td colspan="1" rowspan="1">68800</td><td colspan="1" rowspan="1">68800</td><td colspan="1" rowspan="1">108800</td></tr><tr><td colspan="1" rowspan="1">≥1000000元</td><td colspan="1" rowspan="1">288800</td><td colspan="1" rowspan="1">188800</td><td colspan="1" rowspan="1">128800</td><td colspan="1" rowspan="1">128800</td><td colspan="1" rowspan="1">128800</td><td colspan="1" rowspan="1">168800</td></tr></tbody></table>',
    '<p>例：当日体育场馆有效50000元有效投注即可点击领取18800元宝；同时在真人场馆达到10000有效投注即可领取1600元宝。</p>',
    '<ol><li>每日在不同馆投注，单场馆累计有效投注额≥1000元即可点击领取元宝，以领取前符合的最高有效投注额档位派发元宝，单场馆独立计算且每日仅限一次，请及时点击领取，次日00:00将自动重置！</li><li>重置元宝按自然月计算（比如：9月1日-9月30日为一个自然月）；</li><li>当日有效投注额只计算当日已结算的注单；任何走水、串关、提前结算、取消的赛事不计算在此活动有效投注内；低于欧洲盘1.5或香港盘0.5的投注、以及在同一赛事中同时投注对冲盘口将不计算在此活动有效投注内；</li><li>此活动PM哈希场馆不参与，与其他元宝任务共享（注：若其他优惠明确标注不与本活动共享，将按照其他活动规则要求计算）；</li><li>每位真实有效玩家/每一手机号码/电子邮箱/户籍地址/现居地址/同一银行卡/每一IP地址/每一台电脑或上网设备，仅能享受每种活动方案的一次优惠，若有违规者，将不享受此红利；</li><li>若发现有套利客户，对赌或不诚实获取盈利之行为，将取消其优惠资格；</li><li>为避免文字理解差异，OD体育保留本活动最终解释权。</li></ol>',
    '<h2>签到领元宝：</h2><p>邀好友成功注册后，每日受邀人领取新人元宝时，邀请人自动获得相同的元宝（还可点击领取下方额外元宝）；新人签到中断时重新开始计算连续签到奖励，若当前邀请人的所有受邀会员无一人完成当日签到，则受邀人中断奖励且重新计算，每个周期为7天直至达到活动最高领取天数！</p>',
    '<h2>老友回归：</h2><p>任意渠道注册且连续未投注20天的会员，第21天00:00开始，登录即可连续领取30天老友回归元宝，连续回归签到获得高额元宝！签到中断时重新开始计算连续签到奖励，每个周期为7天直至达到活动最高领取天数。</p>',
    '<ol><li>【新人召唤】复制此页面上方【邀友注册链接】至受邀人，受邀人成功注册绑定手机号即可点击领取，邀请人自动获得相应元宝和点击领取额外元宝；受邀人从注册当日起计算，30内可连续点击领取，超过30日将不可领取新人签到元宝（可邀请新人注册领取）；元宝请在当前自然月及时使用，未使用的元宝将在次月1日00:00清零；签到中断时重新开始计算连续签到奖励，每个周期为7天直至达到活动最高领取天数；</li><li>【老友回归】任意渠道注册且连续20天未投注的会员，第21天00:00开始，登录即可连续领取30天老友回归元宝，连续回归签到获得更高的元宝；元宝请在当前自然月及时使用，未使用的元宝将在次月1日00:00清零；签到中断时重新开始计算连续签到奖励，每个周期为7天直至达到活动最高领取天数；</li><li>此活动与其他元宝任务共享（注：若其他优惠明确标注不与本活动共享，将按照其他活动规则要求计算）；</li><li>每位用户需满足：每一个手机号码、电子邮箱、IP地址、相同银行卡、同一台电脑仅可注册一个 OD会员账号，如发现有违规用户，我们将保留无限期审核扣回红利及所产生利润的权利；若经审核发现会员以不诚实方式套取红利，OD体育将有权取消、收回优惠以及产生的盈利。</li><li>为避免文字理解差异，OD体育对活动拥有最终解释权。</li></ol>',
];

export const formatContentItem = (content) => {
    // “分割”单个Item 按P标签
    if (typeof content !== 'string' || !content) {
        return [];
    }
    return content.match(/<p[^><]*?>.*?<\/p>|<details[^><]*?>[\s\S]*?<\/details>/g);
};
